conversion_rates = [
    # В Дюймы, Ярды, Мили, Миллиметры, Сантиметры, Метры, Километры
    [1, 1/36, 1/63360, 25.4, 2.54, 0.0254, 0.0000254],  # из дюймов
    [36, 1, 1/1760, 914.4, 91.44, 0.9144, 0.0009144],   # из ярдов
    [63360, 1760, 1, 1609344, 160934.4, 1609.344, 1.60934],  # из милей
    [0.0393701, 0.00109361, 0.000000621371, 1, 0.1, 0.001, 0.000001],  # из миллиметров
    [0.393701, 0.0109361, 0.00000621371, 10, 1, 0.01, 0.00001],  # из сантиметров
    [39.3701, 1.09361, 0.000621371, 1000, 100, 1, 0.001],  # из метров
    [39370.1, 1093.61, 0.621371, 1000000, 100000, 1000, 1]  # из километров
]

length = float(input("Введите длину: "))
from_unit = input("Введите текущую единицу измерения (дюймы, ярды, мили, миллиметры,\
	миллиметры сантиметры, метры, километры): ")
to_unit = input("В какую единицу измерения преобразовать(дюймы, ярды, мили, миллиметры,\
 сантиметры, метры, километры): ")

units = ["дюймы", "ярды", "мили", "миллиметры", "сантиметры", "метры", "километры"]
from_index = units.index(from_unit)
to_index = units.index(to_unit)

converted_length = length * conversion_rates[from_index][to_index]

print(f"{length}   равны {converted_length} ") 	