s = input("Введите имя и фамилию: ")
s1 = " "
for i in s:
	if i !=" ":
		s1 = s1 +i
	if i == " ":
		print("Уважаемый",s,",")
		print()
		print(
"Я рад предложить вам нашу новую бонусную карту Platinum Plus  со специальной" 
"вступительной  ставкой 47,99% годовых.",s1,", подобное предложение поступает"
" не каждый день, поэтому я настоятельно призываю вас позвонить сейчас по бесплатному"
"номеру 1-800-314-1592. Мы не можем долго предлагать такую низкую ставку,", s1,
", поэтому звоните прямо сейчас.")  
		